export const currData = [
  {
    name: 'สาขาวิชาคณิตศาสตร์และวิทยาการคำนวณ',
    id: 'mathcom',
    cover: 'mth167',
    content: [
      {
        title: 'คำอธิบายหลักสูตร',
        ct: 'โรงเรียนมหิดลวิทยานุสรณ์ให้ความสำคัญกับการพัฒนาหลักสูตรเพื่อเตรียมความพร้อมให้กับนักเรียน โดยเน้นทักษะที่จำเป็นในศตวรรษที่ 21 หลักสูตรของสาขาวิชาคณิตศาสตร์และวิทยาการคำนวณ (Department of Mathematics and Computing Science) จะแบ่งเป็นรายวิชาพื้นฐานและรายวิชาเพิ่มเติม โดยเนื้อหาในรายวิชาพื้นฐานจะครอบคลุมหลักสูตรแกนกลางการศึกษาขั้นพื้นฐานของกระทรวงศึกษาธิการและมีเนื้อหาเพิ่มเติมในบางหัวข้อ โดยหลักสูตรจะมุ่งส่งเสริมให้นักเรียนมีทักษะกระบวนการคิดวิเคราะห์อย่างเป็นระบบ มีเหตุมีผล มีความรู้รอบ สามารถประยุกต์ใช้ความรู้ทางคณิตศาสตร์และวิทยาการคำนวณในการแก้ปัญหาได้ เพื่อให้นักเรียนมีพื้นฐานที่ดีพอในการศึกษาทางด้านวิทยาศาสตร์เทคโนโลยี',
      },
      {
        title: 'จำนวนหน่วยกิต',
        ct: 'โครงสร้างหลักสูตรโรงเรียนมหิดลวิทยานุสรณ์ พุทธศักราช 2562 กำหนดหน่วยกิตของรายวิชาพื้นฐานกลุ่มสาระการเรียนรู้คณิตศาสตร์จำนวน 10.0 หน่วยกิต และกลุ่มสาระวิทยาศาสตร์และเทคโนโลยีเฉพาะในส่วนของวิทยาการคอมพิวเตอร์จำนวน 3.5 หน่วยกิต นอกจากนี้ สาขาวิชายังมีรายวิชาเพิ่มเติมทางด้านคณิตศาสตร์และวิทยาการคำนวณที่หลากหลาย ทันสมัย และน่าสนใจ ให้นักเรียนได้เลือกเรียนตามความสนใจ ไม่ว่าจะเป็นทางด้านคณิตศาสตร์บริสุทธิ์ และด้านคณิตศาสตร์ประยุกต์ เช่น คณิตศาสตร์การเงิน (Financial Mathematics) คณิตศาสตร์อุตสาหกรรม (Industrial Mathematics) วิทยาศาสตร์ข้อมูล (Data Science) การเรียนรู้ของเครื่อง (Machine Learning) และอินเตอร์เน็ตของสรรพสิ่ง (Internet of Thing: IoT) เป็นต้น ซึ่งนักเรียนที่จบการศึกษาจากโรงเรียนมหิดลวิทยานุสรณ์ จะมีพื้นฐานทางคณิตศาสตร์และวิทยาการคำนวณที่ดีเยี่ยมทัดเทียมระดับนานาชาติ สามารถไปศึกษาต่อในระดับอุดมศึกษาของมหาวิทยาลัยชั้นนำทั้งในประเทศและต่างประเทศได้อย่างราบรื่น',
      },
      {
        title: 'การวัดการปรเมินผล',
        ct: 'ในรายวิชาด้านคณิตศาสตร์และวิทยาการคำนวณจะมีการวัดการประเมินผลผ่านกระบวนการที่หลากหลายและเหมาะสมต่อการเรียนรู้เรื่องต่าง ๆ โดยเน้นการประเมินสมรรถนะผู้เรียนเป็นหลัก',
      },
      {
        title: 'การเทียบโอนหน่วยกิต',
        ct: 'สำหรับนักเรียนที่มีความชอบในวิชาด้านคณิตศาสตร์และวิทยาการคำนวณ นักเรียนสามารถเข้าร่วมโครงการโอลิมปิกวิชาการ สอวน. หลังจากจบค่ายนักเรียนสามารถนำรายวิชาที่เรียนในค่าย สอวน. ซึ่งจัดโดยโรงเรียนมหิดลวิทยนุสรณ์มายื่นขอให้โรงเรียนเทียบโอนผลการเรียนได้',
      },
      {
        title: 'ลักษณะการสอน',
        ct: 'โรงเรียนมหิดลวิทยานุสรณ์ให้ความสำคัญกับจากเป้าหมายการจัดการเรียนการสอนของโรงเรียนมหิดลวิทยานุสรณ์  การเรียนการสอนในรายวิชาคณิตศาสตร์และวิทยาการคำนวณจะมุ่งเน้นให้นักเรียนได้พัฒนาทักษะแห่งอนาคต โดยจัดการเรียนการสอนในรูปแบบที่หลากหลายขึ้นกับความเหมาะสมของแต่ละเนื้อหา ทั้งการบรรยายให้ความรู้ การอภิปรายซักถาม การเรียนรู้ด้วยตนเองผ่านเอกสารและคลิปการสอน และกิจกรรมการเรียนรู้ต่าง ๆ',
      },
      {
        title: '',
        ct: 'ตารางต่อไปนี้แสดงตัวอย่างรายวิชาคอมพิวเตอร์ที่นักเรียนจะได้เรียน ในแต่ละภาคเรียนพร้อมกับจำนวนหน่วยกิต',
        noid: true,
      },
      {
        title: '',
        ct: '<b>รายวิชาพื้นฐาน</b> กลุ่มสาระการเรียนรู้วิทยาศาสตร์และเทคโนโลยี สาระวิทยาการคอมพิวเตอร์',
        noid: true,
        table: [
          ['ที่', 'รายวิชา', 'ระดับชั้น/ภาคเรียน', 'หน่วยกิต'],
          [
            '1',
            'ว30181 วิทยาการคอมพิวเตอร์เบื้องต้น (Introduction to Computer Science)',
            'ม.4 / ภาคเรียนที่ 1',
            '1.0',
          ],
          [
            '2',
            'ว30182 การเขียนโปรแกรมคอมพิวเตอร์ (Computer Programming)',
            'ม.4 / ภาคเรียนที่ 2',
            '1.0',
          ],
          [
            '3',
            'ว30183 วิทยาศาสตร์ข้อมูลสำหรับการประยุกต์ใช้ในชีวิตจริง (Data Science for Real World Applications)',
            'ม.5 / ภาคเรียนที่ 1',
            '1.5',
          ],
        ],
      },
      {
        title: '',
        ct: '<b>รายวิชาเพิ่มเติม</b> กลุ่มสาระการเรียนรู้วิทยาศาสตร์และเทคโนโลยี สาระวิทยาการคอมพิวเตอร์',
        noid: true,
        table: [
          ['ที่', 'รายวิชา', 'หน่วยกิต'],
          ['1*', 'ว30701 การเขียนโปรแกรมภาษาซี (C Programming)', '1.0'],
          ['2*', 'ว30702 โครงสร้างข้อมูล (Data Structures)', '1.0'],
          ['3*', 'ว30703 อัลกอริทึม 1 (Algorithms 1)', '1.0'],
          ['4*', 'ว30704 อัลกอริทึม 2 (Algorithms 2)', '1.0'],
          [
            '5',
            'ว30705 พื้นฐานการเรียนรู้ของเครื่อง (Machine Learning Foundation)',
            '1.0',
          ],
          [
            '6',
            'ว30706 ทำเหมืองข้อมูลเบื้องต้น (Introduction to Data Mining)',
            '1.0',
          ],
          [
            '7',
            'ว30707 อินเทอร์เน็ตของสรรพสิ่งเบื้องต้น (Introduction to Internet of Things)',
            '1.0',
          ],
          [
            '8',
            'ว30708 การเขียนโปรแกรมบนอุปกรณ์สื่อสารเคลื่อนที่ (Mobile Application Programming)',
            '1.0',
          ],
          [
            '9',
            'ว30709 การประมวลผลสัญญาณและภาพดิจิทัล (Digital Signal and Image Processing)',
            '1.0',
          ],
          ['10', 'ว30710 วิทยาการหุ่นยนต์ 1 (Robotics 1)', '1.0'],
          ['11', 'ว30711 วิทยาการหุ่นยนต์ 2 (Robotics 2)', '1.0'],
        ],
      },
      {
        title: '',
        ct: '* รายวิชา สอวน.',
        noid: true,
      },
      {
        title: '',
        ct: 'รายวิชาที่ 5 - 11  เป็นรายวิชาเพิ่มเติม นักเรียนสามารถลงทะเบียนเรียนได้ตามความสนใจ',
        noid: true,
      },
      {
        title: '',
        ct: 'ลักษณะของการจัดการเรียนการสอนในส่วนของวิชาคอมพิวเตอร์ จะมีทั้งส่วนที่เป็นภาคทฤษฎี และภาคปฏิบัติที่เน้นให้ผู้เรียนได้ลงมือปฏิบัติจริง เช่น การเขียนโปรแกรม เป็นต้น ในส่วนรายละเอียดของรายวิชาคณิตศาสตร์สามารถศึกษารายละเอียดรายวิชาต่าง ๆ ได้ ทางเว็บไซต์ของโรงเรียน',
      },
    ],
  },
  {
    name: 'สาขาวิชาเคมี',
    id: 'chemistry',
    cover: 'chm167',
    vid: 'https://www.youtube.com/embed/BIc3sHF2LBg?modestbranding=1&color=white&iv_load_policy=3',
    content: [
      {
        title: '',
        ct: '',
        list: [
          'หลักสูตรนี้เป็นหลักสูตรโรงเรียนมหิดลวิทยานุสรณ์ปีพ.ศ. 2562 ซึ่งในปี 2566 จะมีการปรับใช้หลักสูตรใหม่',
          'คำอธิบายรายวิชาสามารถศึกษาได้จาก QR code ในวิดิโอ',
          'Cr. ข้อมูลใน clip video   จากคณะครูสาขาวิชาเคมี',
        ],
        listdot: true,
      },
    ],
  },
  {
    name: 'สาขาวิชาชีววิทยาและวิทยาศาสตร์สุขภาพ',
    sub: 'กลุ่มสาระการเรียนรู้ชีววิทยา',
    id: 'biology',
    cover: 'bio167',
    content: [
      {
        title: 'กลุ่มสาระการเรียนรู้ชีววิทยา',
        ct: '',
        subtt: true,
      },
      {
        title: 'คำอธิบายหลักสูตร',
        ct: 'หลักสูตรชีววิทยา ประกอบไปด้วยรายวิชาพื้นฐาน จำนวน 5 รายวิชา (5.5 หน่วยกิต) คือ',
        list: [
          'ว30161 โลกของสิ่งมีชีวิต',
          'ว30162 พัฒนาการของสิ่งมีชีวิต',
          'ว30163 การตอบสนองของสิ่งมีชีวิต',
          'ว30164 การรักษาสมดุลของสิ่งมีชีวิต',
          'ว30165 วิวัฒนาการของสิ่งมีชีวิต',
        ],
      },
      {
        title: '',
        ct: 'สำหรับรายวิชาเพิ่มเติม มี จำนวน 21 รายวิชา โดยนักเรียนสามารถเลือกเรียนได้ตามความถนัดและความสนใจของแต่ละบุคคล ซึ่งรายวิชาเพิ่มเติมทางชีววิทยานี้ได้ถูกพัฒนาให้สอดคล้องตามพันธกิจของโรงเรียนมหิดลวิทยานุสรณ์ในการจัดการศึกษาสำหรับนักเรียนที่มีความสามารถพิเศษทางวิทยาศาสตร์และคณิตศาสตร์ ที่มีความเข้มข้นลึกซึ้งในสาขาวิชาต่างๆ อันจะส่งผลให้นักเรียนได้พัฒนาตนเองเต็มตามศักยภาพเป็นรายบุคคล',
      },
      {
        title: 'จำนวนหน่วยกิต',
        ct: '5.5 หน่วยกิต (เฉพาะรายวิชาพื้นฐาน)',
      },
      {
        title: 'การวัดและการประเมินผล',
        ct: 'การวัดและการประเมินผลการเรียนรู้วิชาชีววิทยา มีการประเมินผู้เรียนทั้งผลสัมฤทธิ์ทางการเรียน ทักษะกระบวนการที่เกี่ยวข้องกับชีววิทยา และค่านิยมอันพึงประสงค์อันเป็นผลเนื่องจากการจัดกิจกรรมการเรียนการสอน โดยวัดผลผ่านกระบวนการที่หลากหลายและเหมาะสมต่อการเรียนรู้เรื่องต่าง ๆ โดยเน้นการประเมินสมรรถนะผู้เรียนเป็นหลัก มีการวัดและประเมินผลผู้เรียนอย่างสม่ำเสมอเพื่อพัฒนาผู้เรียนได้อย่างทันท่วงที',
      },
      {
        title: 'วิชาเพิ่มเติมที่เปิด',
        ct: 'จำนวน 21 รายวิชา',

        noid: true,
        table: [
          ['ลำดับที่', 'รหัสวิชา', 'ชื่อวิชา', 'หน่วยกิต'],
          ['1', 'ว30601', 'พันธุศาสตร์ขั้นสูง (Advanced Genetics)', '1.0'],
          ['2', 'ว30602', 'แพลงก์ตอนวิทยา (Planktonology)', '1.0'],
          [
            '3',
            'ว30603',
            'สรีรวิทยาพืชขั้นสูง (Advance Plant Physiology)',
            '1.0',
          ],
          ['4', 'ว30604', 'อนุกรมวิธานพืช (Plant Taxonomy)', '1.0'],
          [
            '5',
            'ว30605',
            'สัตว์ไม่มีกระดูกสันหลัง (Invertebrate Zoology)',
            '1.0',
          ],
          ['6', 'ว30606', 'สัตว์มีกระดูกสันหลัง (Vertebrate Zoology)', '1.0'],
          ['7', 'ว30607', 'กีฏวิทยา (Entomology)', '1.0'],
          [
            '8',
            'ว30608',
            'สรีรวิทยาของมนุษย์และโรคที่เกิดจากความผิดปกติทางสรีรวิทยา (Human Physiology and Disease)',
            '1.0',
          ],
          ['9', 'ว30609', 'นิติวิทยาศาสตร์ (Forensic Science)', '1.0'],
          [
            '10',
            'ว30610',
            'สรีรวิทยาสิ่งแวดล้อม (Environmental Physiology)',
            '1.0',
          ],
          ['11', 'ว30611', 'วิทยาศาสตร์การอาหาร (Food Science)', '1.0'],
          ['12', 'ว30612', 'จุลชีววิทยา (Microbiology)', '1.0'],
          [
            '13',
            'ว30613',
            'เทคนิคปฏิบัติการทางชีววิทยา\n(ฺBiological Laboratory Techniques)',
            '1.0',
          ],
          ['14', 'ว30614', 'ชีววิทยาของเซลล์ (Cell Biology)', '1.0'],
          [
            '15',
            'ว30615',
            'การออกแบบการทดลองและชีวสถิติ\n(Design of Experiment and Biostatistics)',
            '1.0',
          ],
          ['16', 'ว30616', 'พืชเศรษฐกิจ (Economic Crops)', '1.0'],
          ['17', 'ว30617', 'การผลิตเห็ด (Mushroom Production)', '1.0'],
          ['18', 'ว30618', 'กิณวิทยา (Mycology)', ''],
          [
            '19',
            'ว30619',
            'หลักการเลี้ยงสัตว์ (Principles of Animal Husbandry)',
            '1.0',
          ],
          [
            '20',
            'ว30620',
            'เทคโนโลยีการผลิตพืช (Plant Production Technology)',
            '1.0',
          ],
          [
            '21',
            'ว30621',
            'จุลชีววิทยาทางการแพทย์ (Medical Microbiology)',
            '1.0',
          ],
        ],
      },
      {
        title: 'การเทียบโอนหน่วยกิต (สำหรับสอวน.)',
        ct: 'นักเรียนโรงเรียนมหิดลวิทยานุสรณ์ ในโครงการโอลิมปิกวิชาการ สอวน. วิชาชีววิทยา ที่ผ่านการประเมินผลครบทั้ง 2 ค่าย (ค่าย 1 และ ค่าย 2) สามารถใช้สิทธิ์เทียบโอนผลการเรียนได้จำนวน วิชา ดังนี้',
        table: [
          ['รหัสวิชา', 'ชื่อวิชา', 'หน่วยกิต'],
          ['ว30163', 'การตอบสนองของสิ่งมีชีวิต', '1.0'],
          ['ว30164', 'การรักษาสมดุลของสิ่งมีชีวิต', '1.0'],
          ['ว30165', 'วิวัฒนาการของสิ่งมีชีวิต', '1.0'],
          ['ว30601', 'พันธุศาสตร์ขั้นสูง', '1.0'],
        ],
      },
      {
        title: 'ลักษณะการเรียนการสอน',
        ct: 'การเรียนการสอนชีววิทยาของโรงเรียนฯ ต้องการให้ผู้เรียนได้เรียนรู้วิทยาศาสตร์ผ่านการศึกษาสิ่งมีชีวิตโดยการจัดการเรียนการสอนมุ่งเน้นการเชื่อมโยงความรู้กับกระบวนการที่ได้มาซึ่งความรู้ มีการเรียนการสอนโดยการสืบเสาะหาความรู้และการแก้ปัญหาที่หลากหลาย ช่วยผู้เรียนเชื่อมโยงความรู้หรือแนวคิด (Concept) ให้เป็นโครงข่ายความรู้ (Network) มีกิจกรรมที่ได้ลงมือปฏิบัติเพื่อพัฒนาทักษะกระบวนการทางวิทยาศาสตร์และและใช้เทคโนโลยีร่วมสมัยผ่านการเรียนรู้อย่างสนุกสนานส่งเสริมการพัฒนาทักษะแห่งศตวรรษที่ 21',
      },
      {
        title: 'มุมมองของอาจารย์ในสาขา',
        ct: 'การเรียนการสอนชีววิทยาที่ MWIT มีความพร้อมทุกด้าน ทั้งผู้สอนที่เชี่ยวชาญการจัดการเรียนการสอนและการทำวิจัยด้านชีววิทยา อุปกรณ์ และหลักสูตร หากนักเรียนมีความสนใจใฝ่เรียนรู้ ย่อมสามารถพัฒนาความรู้ได้เต็มศักยภาพสมความปรารถนาแน่นอน',
      },
      {
        title: 'ฝากถึงผู้เข้าร่วมงาน Open house',
        ct: 'ไม่ได้เป็นเฮอร์ไมโอนี่ แต่ถ้าเรียน Biology ที่ MWIT นี่จะเสกให้รู้ว่าฟินไม่ไหว',
      },
    ],
  },
  {
    name: 'สาขาวิชาชีววิทยาและวิทยาศาสตร์สุขภาพ',
    sub: 'กลุ่มสาระการเรียนรู้สุขศึกษาและพลศึกษา',
    cover: 'hpe167',
    id: 'hpe',
    content: [
      {
        title: 'กลุ่มสาระการเรียนรู้สุขศึกษาและพลศึกษา',
        ct: '',
        subtt: true,
      },
      {
        title: 'รายวิชาพื้นฐาน',
        ct: 'จํานวน 6 รายวิชา จำนวน 3 หน่วยกิต คือ',
        list: [
          'พ30101 สุขศึกษาและพลศึกษา 1',
          'พ30102 สุขศึกษาและพลศึกษา 2',
          'พ30103 สุขศึกษาและพลศึกษา 3',
          'พ30104 สุขศึกษาและพลศึกษา 4',
          'พ30105 สุขศึกษาและพลศึกษา 5',
          'พ30106 สุขศึกษาและพลศึกษา 6',
        ],
      },
      {
        title: '',
        ct: 'การจัดการเรียนการสอนในรายวิชาพื้นฐานในแต่ละภาครียนกิจกรรมและทักษะต่าง ๆ ผู้เรียนจะได้รับในส่วนของรายวิชาสุขศึกษา คือ แนวทางการสร้างเสริมประสิทธิภาพการทำงานของระบบต่าง ๆ ของร่างกาย  ป้องกันโรค ปัญหาของสุขภาพของคนไทย สิทธิของผู้บริโภค อิทธิพลของสื่อ หลักการเลือกใช้ยา ทักษะการปฐมพยาบาลเบื้องต้น การป้องกันและแนวทางการแก้ไขความรุนแรง ความขัดแย้ง หลักการวางแผนดูแลสุขภาพของตนเอง ครอบครัว สาเหตุของการเสียชีวิตของประชากรไทย การป้องกันการใช้สารเสพติด  อารมณ์ละความเครียด การเข้าร่วมกิจกรรมนันทนาการ ทักษะการช่วยฟื้นคืนชีพ แนวทางการสร้างเสริมสุขภาพของชุมชน การป้องกันสาธารณภัย เพศศึกษา ทักษะการดูและผู้ป่วยระยะพักฟื้น',
      },
      {
        title: '',
        ct: 'เนื้อหาการเรียนการสอนในส่วนของพลศึกษาทั้ง 6 ภาคเรียนประกอบไปด้วย วิธีการทดสอบการแปลผลของสมรรถภาพทางกายเพื่อสุขภาพและสมรรถภาพทางกลไก หลักความปลอดภัยในการออกกำลังกาย และมี ทักษะการเคลื่อนไหวพื้นฐานที่ถูกต้อง หลักความปลอดภัยในการออกกำลังกายและเล่นกีฬา มีทักษะการเคลื่อนไหวพื้นฐานของกีฬาบาเกตบอล กีฬาวอลเลย์บอล กีฬามวยไทย กีฬาทักษะการใช้แร็กเกต และการเคลื่อนไหวเข้าจังหวะ',
      },
      {
        title: 'รายวิชาเพิ่มเติม',
        ct: 'ประกอบไปด้วย 6 รายวิชา จำนวน 6 หน่วยกิต เป็นรายวิชาที่เปิดและนักเรียนสามารถเลือกเรียนได้ตามความสนใจประกอบไปด้วย',
        list: [
          'พ30201 กีฬาประเภททีม',
          'พ30202 กีฬาแบดมินตัน',
          'พ30203 การฝึกด้วยน้ำหนัก',
          'พ30204 ศิลปะการต่อสู้ป้องกันตัว',
          'พ30205 กีฬาทางน้ำ',
          'พ30206 ผู้นำนันทนาการ',
        ],
      },
      {
        title: '',
        ct: 'การจัดการเรียนการสอนรายวิชาเพิ่มเติมต้องการให้ผู้เรียนได้มีความรู้ ความเข้าใจ หลักการพื้นฐานของกีฬาประเภททีม เข้าร่วมการเล่นและแข่งขันกีฬา มีความรู้ความเข้าใจมารยาทของการเป็นผู้เล่น และผู้ชมที่ดีมีความรู้ ความเข้าใจหลักความปลอดภัยของกีฬา แสดงทักษะการเอาชีวิตรอดทางน้ำ และการช่วยเหลือผู้ประสบภัยทางน้ำได้ สามารถแสดงทักษะการเคลื่อนไหวของกีฬาทักษะการจัดกิจกรรมและการเป็นผู้นากิจกรรมนันทนาการ',
      },
      {
        title:
          'การวัดเพื่อประเมินผลทางการเรียนสุขศึกษาและพลศึกษารายวิชาพื้นฐานและรายวิชาเพิ่มเติม',
        ct: 'การประเมินผลทั้ง 2 รายวิชาจะไม่มีการสอบกลางภาคและปลายภาคเรียน การเก็บคะแนนการทดสอบการประเมินผลจะอยู่ในระหว่างการเรียน โดยครูผู้สอนจะแจ้งผ่านโครงการสอนเกี่ยวกับกิจกรรมการสอบและการเก็บคะแนน ทั้งนี้ความสำคัญในการวัดเพื่อประเมินทางการเรียนยังคงไว้ตามหลักการและกระบวนการพัฒนาผู้เรียนตามหลักการสอนสุขศึกษาและพลศึกษาทั้ง  5 ด้าน คือ สมรรถภาพทางกาย ความรู้ ทักษะ คุณธรรมจริยธรรม และเจตคติ',
      },
      {
        title: '',
        ct: '<b>ในฐานะครูผู้สอน</b> ในการจัดทำหลักสูตรสุขศึกษาและพลศึกษาได้จัดทำและพัฒนาความรู้ที่จะจัดลงในตัวหลักสูตรให้มีความทันสมัยมีองค์ความรู้ในปัจจุบันและหลากหลาย เพื่อผู้เรียนจะสามารถนำไปใช้ได้จริงในชีวิตประจำวันเนื้อหาต่าง ๆ ในการเรียนแต่ละภาคเรียนมีความเชื่อมโยงกัน ซึ่งผู้เรียนจะได้นำความรู้มาต่อยอดและฝึกทักษะมากขึ้น เมื่อเรียนจบแล้วสิ่งที่อยากให้ผู้เรียนได้รับและเกิดขึ้นหลังจากผ่านหลักสูตรของเราไปคือ <b>“ดูกีฬาเป็น เล่นกีฬาได้ มีความรู้ที่ถูกต้องทันสมัย ดูแลตนเองให้ปลอดภัยทั้งร่างกายจิตใจ นำความรู้และทักษะต่าง ๆ ไปใช้ในการดูแลและพัฒนาสุขภาพตลอดชีวิต”</b>',
      },
    ],
  },
  {
    name: 'สาขาวิชาฟิสิกส์',
    id: 'physics',
    cover: 'phy167',
    content: [
      {
        title: '',
        ct: '<b>ฟิสิกส์ (Physics)</b> เป็นสาขาวิชาหนึ่งของวิทยาศาสตร์ที่ศึกษาเกี่ยวกับธรรมชาติของสสารและพลังงาน เช่น การเคลื่อนที่ ของไหล ความร้อน เสียง แสง ไฟฟ้า แม่เหล็ก และอะตอม เป็นต้น รวมทั้งปรากฏการณ์ต่าง ๆ ที่เกิดขึ้น โดยใช้กระบวนการทางวิทยาศาสตร์และความรู้ทางคณิตศาสตร์ในการสืบเสาะหาความรู้ เพื่อให้เข้าใจกฎของธรรมชาติ อันจะเป็นประโยชน์ต่อการดำรงชีวิตและการประยุกต์ใช้องค์ความรู้ในการพัฒนาเทคโนโลยี',
      },
      {
        title: '',
        ct: 'หลักสูตรวิชาพื้นฐาน สาขาวิชาฟิสิกส์ โรงเรียนมหิดลวิทยานุสรณ์ มีทั้งสิ้น 6.5 หน่วยกิต ครอบคลุมเนื้อหาตามหลักสูตรแกนกลางการศึกษาขั้นพื้นฐาน พ.ศ.2551 ระดับมัธยมศึกษาตอนปลาย แต่เพิ่มความเข้มข้นโดยใช้แคลคูลัสเป็นฐานในการเรียนรู้ฟิสิกส์เชิงลึก และมีรายวิชาเพิ่มเติมให้นักเรียนได้เลือกเรียนตามความสนใจและความถนัดอีกจำนวนมาก',
      },
      {
        title: '',
        ct: 'การจัดเรียนการสอนวิชาฟิสิกส์ มีเป้าหมายเพื่อพัฒนาผู้เรียนให้เกิดสมรรถนะทางวิทยาศาสตร์ โดยแบ่งกิจกรรมการเรียนรู้ ออกเป็น 2 รูปแบบ',
        list: [
          'แบบที่ 1 ทำการทดลองเพื่อวิเคราะห์ และอธิบายปรากฏการณ์ที่เกิดขึ้น เช่น Lab และ Hands-on',
          'แบบที่ 2 ทำการศึกษาทฤษฎีเพื่ออธิบายปรากฏการณ์ทางฟิสิกส์',
        ],
      },
      {
        title: '',
        ct: 'ซึ่งทั้งสองแบบนี้มีจุดเน้นที่ความเข้าใจเชิงลึกในหลักการ/ทฤษฎี/กฎทางฟิสิกส์ และการนำความรู้ไปประยุกต์ใช้ในการแก้ปัญหาที่เกี่ยวข้องกับสถานการณ์ในชีวิตประจำวัน',
      },
      {
        title: '',
        ct: 'การเรียนการสอนวิชาฟิสิกส์ @MWIT ตลอดช่วงสถานการณ์โควิด-19 จนถึงปัจจุบัน ได้ใช้รูปแบบการเรียนรู้แบบผสมผสาน (Hybrid learning) กล่าวคือ มีการแบ่งเวลาเรียนให้นักเรียนได้ศึกษาด้วยตนเอง โดยมอบหมายงานให้ศึกษา เช่น คลิปวิดีโอบรรยายเนื้อหา และนำความรู้ที่ได้มาอภิปรายร่วมกับเพื่อนและครูในชั้นเรียน เพื่อให้เกิดการเรียนรู้แบบ Active learning',
      },
    ],
  },
  {
    name: 'สาขาวิชาภาษาต่างประเทศ',
    id: 'foreignlanguage',
    cover: 'fld167',
    content: [
      {
        title: 'Curriculum',
        ct: "Students will be divided by our in-house placement test called Mahidol Wittayanusorn Test of English Proficiency (MWIT-TEP) into three levels: pre-intermediate, intermediate and advanced. Throughout three years the students will develop all of the skills needed in English communication: listening, reading, writing and speaking. Apart from English, we also provide a variety of second foreign languages based on the students' interest to fulfill their need and their further study.",
      },
      {
        title: 'Foundation courses include',
        ct: '',
        list: [
          'Fundamental English',
          'Developmental English',
          'Practical English',
          'Thematic English',
          'Academic English',
          'English for specific purposes',
        ],
      },
      {
        title: 'Elective courses include',
        ct: '',
        list: [
          'English sounds and phonics',
          'English grammar revisited',
          'Critical reading',
          'Creative Writing',
          'Communicative English',
          'Public speaking',
          'Critical Analysis of English Films',
          'Translation',
          'Speaking Skills for Standardized Tests',
          'Standardized Test Preparation',
          'English for Correspondence and Socialization',
          'Intercultural Communication Seminar',
          'Map to the 21st Century Global Citizenship',
        ],
      },
      {
        title: 'Second foreign language courses',
        ct: '',
        list: ['Chinese', 'Japanese', 'French', 'German', 'Spanish'],
      },
      {
        title: 'มุมมองของอาจารย์ในสาขา',
        ct: 'The teachers in our FLD have a definite goal to develop the MWIT students of all English proficiencies to communicate with other people in their daily life and in academic contexts using the English language effectively. What our FLD has done so far is that we have divided the students into different groups based on their English abilities so that we will be able to manage our classes to suit their language needs.',
      },
      {
        title: '',
        ct: 'The teachers in the roles of peers for the advanced classes; facilitators for the intermediate students; coaches for the pre-intermediate groups will guide the students through classroom activities to make them achieve the ultimate goal of being proficient language users.  A wide range of elective courses and extra-time one-on-one and group conferences have been provided to our students to succeed in their language learning at MWIT. We would try our best to make the frequently-heard statement “No child is left behind” become a reality in our language learning system.',
      },
      {
        title: 'ฝากถึงผู้เข้าร่วมงาน Open house',
        ct: 'Come and join our FLD activity! Probably, you would be one of our future MWIT students who could explore more interesting, useful activities in the real English class with us as well as experience the excitement of the language learning that our FLD at MWIT has provided. Sign up now!',
      },
    ],
  },
  {
    name: 'สาขาวิชาศิลปศาสตร์',
    id: 'liberalart',
    cover: 'lba167',
    sub: 'กลุ่มสาระการเรียนรู้สังคมศึกษาและศิลปะ',
    content: [
      {
        title: 'กลุ่มสาระการเรียนรู้สังคมศึกษาและศิลปะ',
        ct: '',
        subtt: true,
      },
      {
        title: 'คำอธิบายหลักสูตร',
        ct: 'จัดกิจกรรมการเรียนการสอนด้านสังคมศึกษาและศิลปะตามหลักสูตรโรงเรียนมหิดลวิทยานุสรณ์ เพื่อพัฒนานักเรียนผู้มีความสามารถพิเศษด้านคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี ให้เป็นคนเก่งบนพื้นฐานความดี มีคุณธรรม จริยธรรม เสียสละต่อส่วนรวม เติบโตเป็นพลเมืองที่ดี มีความภาคภูมิใจในเกียรติภูมิของความเป็นไทย มีจิตสำนึกในการอนุรักษ์ศิลปวัฒนธรรมไทยและภูมิปัญญาไทย',
      },
      {
        title: 'จำนวนหน่วยกิต',
        ct: '',
        table: [
          ['กลุ่มสาระการเรียนรู้', 'รายวิชาพื้นฐาน\n(หน่วยกิต)'],
          ['สังคมศึกษา', '6.5'],
          ['ศิลปะ', '3.0'],
        ],
      },
      {
        title: 'การวัดและการประเมินผล',
        ct: 'การวัดและประเมินผลของสาขาวิชาศิลปศาสตร์ใช้วิธีการที่หลากหลาย ทั้งการจัดเก็บคะแนนระหว่างภาคเรียน และการสอบปลายภาคเรียนตามตารางของโรงเรียน แบ่งเป็นอัตราส่วนประมาณร้อยละ 70:30 การวัดและประเมินผลระหว่างภาคเรียน พิจารณาจากชิ้นงานและกิจกรรมที่แสดงออกถึงทักษะการคิดวิเคราะห์ การคิดอย่างมีวิจารณญาณ การประเมินค่า และการแก้ปัญหา พร้อมประยุกต์ใช้แนวทาง Design Thinking บูรณาการความรู้ และการประเมินตามสภาพจริง Authentic Assessment เข้ามาผสมผสาน',
      },
      {
        title: 'วิชาเพิ่มเติมที่เปิด',
        ct: 'รายวิชาเพิ่มเติมของกลุ่มสาระการเรียนรู้สังคมศึกษา',
        list: [
          'การรับรู้จากระยะไกล (Remote Sensing)',
          'ระบบสารสนเทศภูมิศาสตร์ (Geographic Information System)',
          'ภูมิเศรษฐกิจ (Ecogeographic)',
          'ภูมิศาสตร์ขั้นสูง (Advanced Geography)',
          'ระบบสารสนเทศภูมิศาสตร์เพื่อประยุกต์ใช้งานภาคสนาม (Geographic Information System for Field Applications)',
          'การสืบเสาะทางโบราณคดี (Archaeological Inquiry)',
          'ทวารวดีศึกษา (Dvaravati Study)',
          'อยุธยาศึกษา (Ayutthaya Study)',
          'รัตนโกสินทร์ศึกษา (Rattanakosin Study)',
          'อาเซียนหลากมิติ (ASEAN Revisited)',
          'การเมืองโลกผ่านสื่อภาพยนตร์ (Global Politic through Film ASEAN Revisited)',
          'การบูรณาการความรู้ (Integration of Knowledge)',
          'ภูมิศาสตร์มนุษย์ (Human geography)',
          'ภูมิศาสตร์กายภาพ (Physical geography)',
        ],
      },
      {
        title: '',
        ct: 'รายวิชาเพิ่มเติมของกลุ่มสาระการเรียนรู้ศิลปะ',
        list: [
          'อาหารไทย (Traditional Thai Food)',
          'ศิลปวัฒนธรรมท้องถิ่น (Local Arts and Culture)',
          'พื้นฐานทฤษฎีดนตรี (Music Theory)',
          'หีบเพลงเป่า (Harmonica)',
          'ดนตรีปฏิบัติ: เครื่องทองเหลือง (Music Performance: Brass Instruments)',
          'ศิลปะปฏิบัติ: สีน้ำมัน (Art Studio : Oil Color)',
          'เซรามิคเบื้องต้น (Ceramics)',
          'ดาวินชี (Davinci)',
          'ภาพยนตร์ (Movie)',
        ],
      },
      {
        title: 'การเทียบโอนหน่วยกิต',
        ct: 'สาขาวิชาศิลปศาสตร์ดูแลกิจกรรมโอลิมปิกวิชาการในรายวิชาภูมิศาสตร์ จึงมีรายวิชาที่สามารถเทียบโอนหน่วยกิตจากการเข้าอบรมในค่ายภูมิศาสตร์โอลิมปิกได้คือ รายวิชา ส30204 ภูมิศาสตร์ขั้นสูง (Advanced Geography) จำนวน 0.5 หน่วยกิต',
      },
      {
        title: 'ลักษณะการเรียนการสอน',
        ct: '',
        list: [
          'จัดกิจกรรมการเรียนการสอนสาระสังคมศึกษา ภาษาไทย และศิลปะแบบบูรณาการ เพื่อส่งเสริมความรู้และประสบการณ์ตรงจากการปฏิบัติกับสถานการณ์ สถานที่ อุปกรณ์จริง สำหรับสาระศิลปะมีการส่งเสริมสุนทรียภาพให้นักเรียนด้วย',
          'พัฒนารูปแบบการจัดการเรียนการสอนแบบบูรณาการสหสาขาวิชา ในรายวิชาศิลปศาสตร์ศึกษา (Liberal Arts) และรายวิชาศิลปศึกษา (Arts Education)',
          'จัดกิจกรรมการเรียนการสอนแบบเข้มข้นในรายวิชาเพิ่มเติมด้านภูมิศาสตร์ เพื่อต่อยอดการเรียนรู้ที่สามารถพัฒนาทักษะการใช้เครื่องมือทางด้านภูมิศาสตร์อย่างถูกต้อง',
          'พัฒนาคุณภาพการจัดทำโครงงานของนักเรียนทางด้านภูมิศาสตร์และศิลปศาสตร์ ได้แก่ โครงงานเกี่ยวกับการใช้เครื่องมือทางภูมิศาสตร์ การพัฒนาทางด้านภาษา และการพัฒนาทางด้านดนตรีโดยใช้โปรแกรมทางเทคโนโลยี โดยส่งเสริมนักเรียนที่สนใจเพื่อพัฒนาศักยภาพการหาความรู้ในรูปแบบการทำโครงงานให้ดียิ่งขึ้น',
        ],
      },
      {
        title: 'มุมมองของอาจารย์ในสาขา',
        ct: 'สาขาวิชาศิลปศาสตร์เป็นสาขาวิชาที่บูรณาการศาสตร์ต่าง ๆ ทางด้านมนุษยศาสตร์และสังคมศาสตร์เข้าไว้ด้วยกัน ซึ่งเป็นศาสตร์ที่จำเป็นต่อการทำความเข้าใจตนเองและผู้อื่นในฐานะที่เป็นมนุษย์ในสังคม สาขาวิชาศิลปศาสตร์จึงช่วยเติมเต็มความรู้และทักษะชีวิตให้แก่นักเรียนนอกเหนือไปจากความเป็นเลิศทางด้านวิทยาศาสตร์',
      },
      {
        title: 'ฝากถึงผู้เข้าร่วมงาน Open house',
        ct: 'กิจกรรม Open House ในปีนี้จัดขึ้นภายใต้แนวคิด Student Empowerment ซึ่งนักเรียน MWIT เป็นแกนหลักในการจัดกิจกรรมขึ้นอย่างตั้งใจ จึงหวังว่าผู้เข้าร่วมงานทุกท่านจะได้รับประโยชน์ ความสนุกสนาน และที่สำคัญคือแรงบันดาลใจในการสานต่อความฝันทางการศึกษา',
      },
    ],
  },
  {
    name: 'สาขาวิชาศิลปศาสตร์',
    id: 'thai',
    cover: 'tha167',
    sub: 'กลุ่มสาระการเรียนรู้ภาษาไทย',
    content: [
      {
        title: 'กลุ่มสาระการเรียนรู้ภาษาไทย',
        ct: '',
        subtt: true,
      },
      {
        title: 'คำอธิบายหลักสูตร',
        ct: 'เรียนรู้และฝึกฝนการใช้ภาษาเป็นเครื่องมือในการติดต่อสื่อสารเพื่อสร้างความเข้าใจและความสัมพันธ์ที่ดีต่อกัน ทำให้สามารถประกอบกิจธุระ การงาน และดำรงชีวิตร่วมกันในสังคมประชาธิปไตยได้อย่างสันติสุข เป็นเครื่องมือในการแสวงหาความรู้ ประสบการณ์จากแหล่งข้อมูลสารสนเทศต่าง ๆ เพื่อพัฒนาความรู้ กระบวนการคิดวิเคราะห์ วิจารณ์ และสร้างสรรค์ ให้ทันต่อการเปลี่ยนแปลงทางสังคม และความก้าวหน้าทางวิทยาศาสตร์ เทคโนโลยี เข้าใจภูมิปัญญาของบรรพบุรุษด้านวัฒนธรรม ประเพณี และสุนทรียภาพ',
      },
      {
        title: 'จำนวนหน่วยกิต',
        ct: 'รายวิชาพื้นฐาน 6 หน่วยกิต',
      },
      {
        title: 'การวัดและการประเมินผล',
        ct: '',
        list: [
          'เน้นการประเมินจากทักษะปฏิบัติ',
          'แบบฝึกและข้อสอบเน้นการคิดวิเคราะห์',
          'ครูและนักเรียนมีส่วนร่วมในการให้ feedback',
        ],
        listdot: true,
      },
      {
        title: 'วิชาเพิ่มเติมที่เปิด',
        ct: '',
        list: [
          'วรรณกรรมกับสังคมและการเมือง (Literature Related to Society and Politics)',
          'อิทธิพลของวรรณกรรมต่างประเทศต่อวรรณกรรมไทย (Influence of Foreign Literature on Thai Literature)',
          'การอ่านและการเขียนร้อยกรอง (Verse Reading and Writing)',
          'การเขียนสารคดี (Feature Writing)',
          'การเขียนเรื่องสั้น (Short Story Writing)',
          'การพูดในที่ประชุมชน (Public Speaking)',
          'สัมมนาภาษาไทย (Thai Seminar)',
          'วรรณกรรมแปล (Translated Literature)',
          'การสอนภาษาไทยในฐานะภาษาต่างประเทศ (Teaching Thai as a Foreign Language)',
        ],
      },
      {
        title: 'ลักษณะการเรียนการสอน',
        ct: '',
        list: [
          'จัดกิจกรรมการเรียนการสอนสาระภาษาไทย สังคมศึกษา และศิลปะแบบบูรณาการ',
          'เน้นฝึกปฏิบัติทักษะการสื่อสาร ทั้งฟัง พูด อ่าน และเขียน ในหลากหลายบริบท สามารถนำไปประยุกต์ใช้ในชีวิตจริงได้',
          'เปิดกว้างให้แสดงความคิดเห็น วิจารณ์ และแสดงความคิดสร้างสรรค์',
        ],
      },
      {
        title: 'มุมมองของอาจารย์ในสาขา',
        ct: '',
        list: [
          'ภาษาก็คือวิทยาศาสตร์ ต้องเรียนรู้อย่างเข้าใจ ใช้และทดลองศึกษาอย่างมีกฎเกณฑ์ (ครูภาษาไทยคนหนึ่ง)',
          'ภาษามีไว้ “สื่อสาร” และ “สื่อสาน (สัมพันธ์)” (ครูภาษาไทยอีกคนหนึ่ง)',
        ],
        listdot: true,
      },
      {
        title: 'ฝากถึงผู้เข้าร่วมงาน Open house',
        ct: 'Play + Learn = เพลิน!',
      },
    ],
  },
]
